kallu

In [1]:
import pandas as pd

# Pallu

In [2]:
type(1)

int

In [3]:
type("true")

str

In [4]:
len("true")

4

In [5]:
df1=pd.DataFrame({"ID":[1,2,3,4],"CLASS":[9,10,11,12]})

In [6]:
df1

   ID  CLASS
0   1      9
1   2     10
2   3     11
3   4     12

In [7]:
df2=pd.DataFrame({"ID":[1,2,3,4],"NAME":["A","B","C","D"]})

In [8]:
df2

   ID NAME
0   1    A
1   2    B
2   3    C
3   4    D

In [9]:
pd.merge(df1,df2,on="ID")

   ID  CLASS NAME
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12    D

In [10]:
pd.merge(df2,df1,on="ID")

   ID NAME  CLASS
0   1    A      9
1   2    B     10
2   3    C     11
3   4    D     12

In [11]:
df2=pd.DataFrame({"ID":[5,6,7,8],"NAME":["A","B","C","D"]})

In [12]:
df2

   ID NAME
0   5    A
1   6    B
2   7    C
3   8    D

In [13]:
pd.merge(df2,df1,left_index=True, right_index=True)

   ID_x NAME  ID_y  CLASS
0     5    A     1      9
1     6    B     2     10
2     7    C     3     11
3     8    D     4     12

In [14]:
df3=pd.DataFrame({"ID":[1,2,3,4],"CLASS":[9,10,11,12]})

In [15]:
df4=pd.DataFrame({"ID":[1,2,3,4],"CLASS":[9,10,11,12]})

In [16]:
pd.merge(df3,df4,on="ID")

   ID  CLASS_x  CLASS_y
0   1        9        9
1   2       10       10
2   3       11       11
3   4       12       12

In [17]:
sr1=pd.Series([1,2,3])
sr1

0    1
1    2
2    3
dtype: int64

In [18]:
sr2=pd.Series([11,12,13])
sr2

0    11
1    12
2    13
dtype: int64

In [19]:
pd.concat([sr1,sr2])

0     1
1     2
2     3
0    11
1    12
2    13
dtype: int64

In [20]:
df5=pd.DataFrame({"ID":[1,2,3,4],"NAME":["A","B","C","D"],"CLASS":[5,6,7,8]})

In [21]:
df5

   ID NAME  CLASS
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [22]:
df6=pd.DataFrame({"ID":[11,12,13,14],"NAME":["AA","BB","CC","DD"],"CLASS":[5,6,7,8]})

In [23]:
pd.concat([df5,df6])

   ID NAME  CLASS
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
0  11   AA      5
1  12   BB      6
2  13   CC      7
3  14   DD      8

In [24]:
pd.concat([df5,df6],axis=0)

   ID NAME  CLASS
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
0  11   AA      5
1  12   BB      6
2  13   CC      7
3  14   DD      8

In [25]:
pd.concat([df5,df6],axis=1)

   ID NAME  CLASS  ID NAME  CLASS
0   1    A      5  11   AA      5
1   2    B      6  12   BB      6
2   3    C      7  13   CC      7
3   4    D      8  14   DD      8

In [26]:
pd.concat([df5,df6],axis=0, ignore_index=False)

   ID NAME  CLASS
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
0  11   AA      5
1  12   BB      6
2  13   CC      7
3  14   DD      8

In [27]:
pd.concat([df5,df6],axis=0, ignore_index=True)

   ID NAME  CLASS
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
4  11   AA      5
5  12   BB      6
6  13   CC      7
7  14   DD      8